{
  "id": 161113,
  "date": "2017-11-01T09:00:22",
  "date_gmt": "2017-11-01T16:00:22",
  "guid": {
    "rendered": "https://www.sitepoint.com/?p=161113"
  },
  "modified": "2017-10-26T20:50:16",
  "modified_gmt": "2017-10-27T03:50:16",
  "slug": "getting-to-know-your-users-with-analytics",
  "status": "publish",
  "type": "post",
  "link": "https://www.sitepoint.com/getting-to-know-your-users-with-analytics/",
  "title": {
    "rendered": "Getting to Know Your Users With Analytics"
  },
  "content": {
    "rendered": "<p><em>The following is a short extract from our book, <a href=\"https://www.sitepoint.com/premium/books/researching-ux-analytics\">Researching UX: Analytics</a>, written by Luke Hay. It&#8217;s the ultimate guide to using analytics for improved user experience. SitePoint Premium members get access with their membership, or you can buy a copy in stores worldwide.</em></p>\n<p>To understand why your users behave the way they do, you first need to get to know them. You may make assumptions about who those users are, but you should be constantly challenging those assumptions, or at least be backing them up with facts.</p>\n<p>There’s a lot of data available in your analytics package that will help build up your knowledge of who’s visiting your website. The more you know about your users, the more informed your design decisions can be.</p>\n<p>This data can form a useful starting point for many different types of research. One area where this data is particularly helpful is in recruiting people for usability tests. In usability testing, the better the participant matches the target persona, the better the test.</p>\n<p>Usability testing should show how “real” users interact with your website, and where they may be experiencing issues. Knowing who your users are will improve the results of your usability testing, and will give you a better chance of uncovering the issues your “real” users are encountering.  </p>\n<p>The following section looks at the data in your analytics tool that will help build up your understanding of who your users are.</p>\n<h3 id=\"how-do-users-find-your-website-\">How Do Users Find Your Website?</h3>\n<p>Analyzing how users are finding your website can help you understand more about them, and about the context of their visit.</p>\n<p>Different analytics tools will classify “traffic sources” or “channels” in different ways. The following are some typical sources for your traffic:</p>\n<ul>\n<li><strong>Organic search</strong>. This typically identifies a user who has clicked an “unpaid” link from the search results.</li>\n<li><strong>Paid search</strong>. Paid search users, sometimes known as “Pay Per Click” or “PPC”, will have arrived on your website via a paid advert on a search engine.</li>\n<li><strong>Referral</strong>. Users from referral links will have followed a link from another website.</li>\n<li><strong>Social</strong>. Social media is often shown as a separate channel from other referral links.</li>\n<li><strong>Direct</strong>. This category includes users who type your domain into the address bar of their browser. It can also include users where the analytics package was unable to identify their traffic source.</li>\n<li><strong>Email</strong>. Links in emails will need to be tagged, since by default, analytics tools are unable to identify users clicking links that don’t appear on web pages.</li>\n</ul>\n<p>This analysis can give you a better idea about your users’ intentions. If you’re running a paid search campaign, for example, you’ll be able to see the keywords that were used to find your website (as long as you’ve linked up the Google Analytics and Adwords accounts, and enabled auto-tagging). If users are finding you based on “brand” search terms, you know they’re aware of your company and are searching for you specifically.</p>\n<p>Analyzing the behavioral metrics for users, broken down by channel, can help content and marketing teams make decisions about the amount of effort, resources, and budget to dedicate to specific channels. From a UX perspective, it can be useful for identifying problem areas (see Chapter 4), but it also helps to give insight into the mindset of your users. Knowing where your users are coming from can help you to identify whether they’re already familiar with your website, and can start to give you clues about the likely purpose of their visit.</p>\n<h3 id=\"where-do-your-users-come-from-\">Where Do Your Users Come From?</h3>\n<p>To begin with, it’s a good idea to start by finding out where—geographically speaking—your users come from. This is a very broad level of analysis that will help you focus your research. Looking at the location of your users will show you the role international visitors play in the success of your website. Geodata will also give you insight into the behavior of users on a national and regional level.</p>\n<p>Most analytics tools will give you location data for your users. In Google Analytics, this can be found in <strong>Audience &gt; Geo &gt; Location</strong>. This report will tell you where your users are coming from, and will also allow you to compare behavior metrics (and different dimensions) for users from different countries, regions or cities.</p>\n<p><img src=\"https://www.sitepoint.com/wp-content/uploads/2017/10/1508948203countryga.png\" alt=\"Location report in Google Analytics\" width=\"1045\" height=\"503\" class=\"aligncenter size-full wp-image-161116\" />\t\t\t</p>\n<p>Looking at the percentage of visitors from each country will help you understand the importance of international visitors to your website.</p>\n<p>But you need to be careful with your analysis here. Just because no one visits your site from Canada, for example, doesn’t necessarily mean that audience is not important to you. You could be accidentally blocking them! Your marketing efforts may not be reaching where they should, or there may be a whole host of other reasons for the lack of visits. Once again, remember that your website analytics tell you <em>what</em>, but not <em>why</em>.</p>\n<p>You may be assuming your website only attracts visitors from your own country, but this report may show that you should also consider the needs of international visitors. This could lead to practical considerations—such as the load speed of your website in other countries, international delivery rates for an ecommerce site, and possible cultural differences between other countries and your own.</p>\n<p>Cultural differences based on the country of your visitors can be considerations for both your website’s design and functionality. These differences can be hard to cater for, as cultural differences may be subtle, and often won’t lead to clear ideas for design changes. Still, detailed research on the cultural needs of you users is definitely recommended.</p>\n<p>On a more practical level, the way people use ecommerce websites varies dramatically depending on their country. According to <a href=\"https://alternativepayments.worldpay.com/territories/DE\">data from Worldpay</a>, only 12% of users in Germany make online purchases using cards.</p>\n<p>This compares with 63% of UK users and 72% of users in the USA. If you notice that your ecommerce website is getting a lot of visits from Germany, you’ll want to look at offering alternative payment methods. The most popular type of online payment in Germany in real-time bank transfer.</p>\n<p>Looking beyond the number of visits, you’ll be able to see behavioral metrics, such as time on site, bounce rate and conversion rate. Focusing on user behavior will enable you to pinpoint particular countries where there may be issues with your website, and thus opportunities to make improvements. If, for example, your ecommerce website is getting a lot of visits from a certain country, or countries, but the conversion rate is low, you may want to reassure those users that you deliver internationally.</p>\n<p>There could be many reasons why your conversion rate is low in a particular country. You may not ship to that country, your site may be in the wrong language, the products may be cheaper in that country, or you may not offer the right payment methods (as in the example of Germany). This is where it’s important not to jump to conclusions. Remember, the data only tells you <em>what</em> is happening. It’s important that you set aside research time to find out <em>why</em>.</p>\n<p>If you can see an opportunity to increase your conversion rate internationally, you might also want to consider personalizing your website in some way for those countries. This could be as simple as showing the flag of that country and being up front about the exact costs and delivery times for that location. This simple form of personalization will likely resonate with your international users, and will help you unlock potential additional revenue from international sales.</p>\n<p>If your analytics shows you’re getting a lot of visits from other countries, you’re likely to be missing out if you don’t factor in cultural differences!</p>\n<p>Geo reports can locate users down to state and city level. This means you may also want to assess your visitors by state, region and city to get a clearer picture of who your visitors are and how they behave. The importance of this level of detail will depend on the purpose of your website. For political websites, for example, localized data can be very important to see how a candidate is performing in a key state or region.  </p>\n<h3 id=\"what-language-do-your-users-speak-\">What Language Do Your Users Speak?</h3>\n<p>Knowing what language your users speak can give you additional insight into the content you should serve up. Language and location are sometimes confused when looking at analytics, but the two dimensions have no direct connection. A user can be located in Paris but speak Spanish. Location is ascertained by the IP address of your user, while their language can be derived from the language settings of their browser.</p>\n<p>You may notice you’re getting a lot of visits from German-speaking users. If this is the case, you might want to look into creating a German version of your site if you don’t already have one.</p>\n<p>As with location, language can also give an indication of the culture of your users. The language used can also have a big impact on your design. Arabic text is displayed from right to left, and the Chinese alphabet contains thousands of characters. Both of these will potentially have a big impact on your page layouts.</p>\n<p>For example, websites targeted at Chinese audiences are likely to contain a lot of links, rather than offering users search options. This is due to Chinese keyboards being more difficult to use than western keyboards, because of the large number of characters in the Chinese alphabet.</p>\n<p>You may be surprised to learn about a larger than expected audience you had no idea existed. It’s likely that users who don’t share your language will be “silent”, and, as a result, may be overlooked and unrepresented when it comes to your user research. By “silent”, I mean these users are less likely to contact you or offer feedback than users who share your language.</p>\n<p>Finding out the languages used by your visitors is, of course, just a starting point. I wouldn’t recommend making any major changes based on this data alone. But it can play a very useful role in your user research process.</p>\n<h3 id=\"what-devices-and-browsers-are-they-using-\">What Devices and Browsers Are They Using?</h3>\n<p>When you know which devices are being used to visit your site, you get a clearer picture of the context in which users are viewing your website. Analyzing browser usage can also help you better understand your users.</p>\n<p>In user research, you should be careful not to rely on stereotypes or to make broad assumptions about your users. That said, knowing which browsers and devices they’re using can help you get a broad sense of their demographics.</p>\n<p>These kinds of studies may help you hypothesize why your users are behaving differently, but I certainly wouldn’t use them on their own. Find out more about your users to test these hypotheses.</p>\n<p>Device information is likely to tell you even more about your users. While you also need to be careful about assumptions, research shows, for example, that <a href=\"http://www.marketingcharts.com/online/the-demographics-of-us-smartphone-and-tablet-users-60669/\">adults in higher-income households are more than three times as likely as those in lower-income households to own a tablet</a>. There are also differences in the demographics of users of different device brands. A study has shown that <a href=\"http://www.forbes.com/sites/toddhixon/2014/04/10/what-kind-of-person-prefers-an-iphone/#6afb33213e5a\">iPhone users are better qualified and more affluent than Android users</a>.</p>\n<p>As with the previous example, there’s some value in these studies, but you need to be very careful how you apply it. Remember, the analytics data will tell you <em>what</em> is happening, but you’ll need to do further research to find out <em>why</em>.</p>\n<p>A common mistake analysts make with device reports is to assume that mobile users are “on the move” (such as commuting), while “desktops” are always used at home. <a href=\"https://www.thinkwithgoogle.com/research-studies/the-new-multi-screen-world-study.html\">A study by Google</a> showed over 60% of mobile usage is at home, while the “desktop” device category includes laptops, which people are likely to use while traveling.</p>\n<p>You need to be careful how you use device and browser data. Don’t make assumptions about your users based on the data alone, but instead let it help shape your research.</p>\n<p>Knowing the breakdown of browser and device types can also help identify who to recruit for user testing. If you know that 75% of your users are visiting your site on a mobile device, you’ll probably want to ensure the majority of your user testing takes place on mobile.</p>\n<h3 id=\"what-are-the-genders-and-ages-of-your-users-\">What are the Genders and Ages of Your Users?</h3>\n<p>Seeing how users from different demographic groups behave on a site can really help build up a picture of the different user types. In 2013, Google Analytics introduced demographic reports, which include information on users’ age, gender and interests. These reports are a potential gold mine for user research. It’s hard to tell exactly how accurate they really are, but the demographic data that Google Analytics reports is usually very similar to my own expectations for sites I know well. Google claims the reports 80–90% accurate, and <a href=\"http://www.humix.be/en/blog/web-analytics-en/how-accurate-are-google-analytics-demographics-reports/\">a study by Humix</a> concludes that the demographic data held by Google appears to be quite accurate.</p>\n<p>When I get a new analytics client, I often ask them about what they expect the breakdown of the age and gender of their users to be. I then compare this to the reports in Google Analytics—and they’re often very similar. While I’d wouldn’t recommend treating this data as if it’s 100% accurate, based on my experience I’d say you can be fairly confident it gives a good representation of the age and gender of your users. If possible, I also recommend testing this yourself, by surveying a sample of site users and correlating the results against the same user segment in Google Analytics.</p>\n<p>This information can be used to directly inform your personas, and to aid with your usability testing recruitment. You can also use this information to confirm, and fix, some concerns you may have about your audience.</p>\n<p>I’m one of the organizers of <a href=\"https://www.uxcampbrighton.org/\">UX Camp Brighton</a>, an annual UX “unconference” that takes place in my home town of Brighton in the UK. Recently, along with my fellow organizers, I had concerns about the gender balance of our attendees. As with most tech events, we were generally getting more male than female attendees, and we were keen to redress this balance. Checking the demographics report for our website confirmed that we did in fact have a far larger percentage of male visitors. Armed with this knowledge, we partnered with <a href=\"http://wespringforward.com/\">Spring Forward</a>, a series of events celebrating the role of women in digital culture. We both promoted each other’s events, and the result was a measurable increase in the percentage of women viewing our website.</p>\n<p><img src=\"https://www.sitepoint.com/wp-content/uploads/2017/10/1508948235genderGA.png\" alt=\"Changes to demographics over time\" width=\"600\" height=\"344\" class=\"aligncenter size-full wp-image-161118\" /></p>\n<p>We don’t collect gender data for ticket sales, so we can’t say for sure whether it changed the audience for the event, but it was certainly a step in the right direction, and is something we’ll look to do again next year.</p>\n<p>As well as age and gender, the demographics reports in Google Analytics give data on the interests of your users. Personally, I find these reports less useful than the other demographic reports. I often see the same, very generic interest groups appearing. Some of the categories are very broad, such as “movie lovers” and “TV lovers”, and probably apply to 90% of people in every community! </p>\n<h3 id=\"how-frequently-are-your-users-visiting-\">How Frequently Are Your Users Visiting?</h3>\n<p>Your analytics tool will be able to help you gauge the loyalty of your users. Users who keep returning to your site are likely to behave differently from first-time visitors. Grouping your users in this way can be helpful when you’re creating user types or personas.</p>\n<p>Below is a screenshot of a typical Frequency &amp; Recency report from Google Analytics. This can be accessed by going to <strong>Audience &gt; Behavior &gt; Frequency &amp; Recency</strong></p>\n<p><img src=\"https://www.sitepoint.com/wp-content/uploads/2017/10/1508948269frequencyga.png\" alt=\"Frequency and Recency report\" width=\"825\" height=\"443\" class=\"aligncenter size-full wp-image-161119\" /></p>\n<p>We can see the majority of visitors only visited once during the selected time period of 30 days. At first glance, this suggests you only need to focus on that group. But if you add the users who visited more than once together, you’ll see they make up nearly 40% of the total.</p>\n<p>It can be helpful here to break these users down into groups that better meet your research requirements. You might want to group users as single visits, 2–10 visits, and 11+ visits. You can then label these groups as “one-off”, “repeat visitors” and “regular visitors”. This will give you a broad but useful overview of how often your users visit your site.</p>\n<h3 id=\"what-content-are-they-interested-in-\">What Content Are They Interested In?</h3>\n<p>In the previous chapter, we covered how to identify problem pages or areas on your website. The Pages report can also be useful for finding out what type of content your users are interested in.</p>\n<p>For example, if you’re looking at data for a real estate website, you may be able to group users into buyers, sellers, renters and letters, depending on the pages they’re viewing. This may not be an easy task, as users won’t always look just at pages targeted to them. In the real estate example, it’s likely people looking to sell their property will also look at properties already on sale to check prices. In this instance, you may need to choose pages further down the funnel to help group your users more accurately.</p>\n<p>This type of information will be useful for various aspects of your research, including creating personas.</p>\n",
    "protected": false
  },
  "excerpt": {
    "rendered": "<p><em>The following is a short extract from our book, <a href=\"https://www.sitepoint.com/premium/books/researching-ux-analytics\">Researching UX: Analytics</a>, written by Luke Hay. It&#8217;s the ultimate guide to using analytics for improved user experience. SitePoint Premium members get access with their membership, or you can buy a copy in stores worldwide.</em></p>\n<p>To understand why your users behave the way they do, you first need to get to know them. You may make assumptions about who those users are, but you should be constantly challenging those assumptions, or at least be backing them up with facts.</p>\n<p>There’s a lot of data available in your analytics package that will help build up your knowledge of who’s visiting your website. The more you know about your users, the more informed your design decisions can be.</p>\n<p>This data can form a useful starting point for many different types of research. One area where this data is particularly helpful is in recruiting people for usability tests. In usability testing, the better the participant matches the target persona, the better the test.</p>\n<p>Usability testing should show how “real” users interact with your website, and where they may be experiencing issues. Knowing who your users are will improve the results of your usability testing, and will give you a better chance of uncovering the issues your “real” users are encountering.  </p>\n<p>The following section looks at the data in your analytics tool that will help build up your understanding of who your users are.</p>\n<h3 id=\"how-do-users-find-your-website-\">How Do Users Find Your Website?</h3>\n<p>Analyzing how users are finding your website can help you understand more about them, and about the context of their visit.</p>\n<p>Different analytics tools will classify “traffic sources” or “channels” in different ways. The following are some typical sources for your traffic:</p>\n<ul>\n<li><strong>Organic search</strong>. This typically identifies a user who has clicked an “unpaid” link from the search results.</li>\n<li><strong>Paid search</strong>. Paid search users, sometimes known as “Pay Per Click” or “PPC”, will have arrived on your website via a paid advert on a search engine.</li>\n<li><strong>Referral</strong>. Users from referral links will have followed a link from another website.</li>\n<li><strong>Social</strong>. Social media is often shown as a separate channel from other referral links.</li>\n<li><strong>Direct</strong>. This category includes users who type your domain into the address bar of their browser. It can also include users where the analytics package was unable to identify their traffic source.</li>\n<li><strong>Email</strong>. Links in emails will need to be tagged, since by default, analytics tools are unable to identify users clicking links that don’t appear on web pages.</li>\n</ul>\n<p>This analysis can give you a better idea about your users’ intentions. If you’re running a paid search campaign, for example, you’ll be able to see the keywords that were used to find your website (as long as you’ve linked up the Google Analytics and Adwords accounts, and enabled auto-tagging). If users are finding you based on “brand” search terms, you know they’re aware of your company and are searching for you specifically.</p>\n<p>Analyzing the behavioral metrics for users, broken down by channel, can help content and marketing teams make decisions about the amount of effort, resources, and budget to dedicate to specific channels. From a UX perspective, it can be useful for identifying problem areas (see Chapter 4), but it also helps to give insight into the mindset of your users. Knowing where your users are coming from can help you to identify whether they’re already familiar with your website, and can start to give you clues about the likely purpose of their visit.</p>\n<h3 id=\"where-do-your-users-come-from-\">Where Do Your Users Come From?</h3>\n<p>To begin with, it’s a good idea to start by finding out where—geographically speaking—your users come from. This is a very broad level of analysis that will help you focus your research. Looking at the location of your users will show you the role international visitors play in the success of your website. Geodata will also give you insight into the behavior of users on a national and regional level.</p>\n<p>Most analytics tools will give you location data for your users. In Google Analytics, this can be found in <strong>Audience &gt; Geo &gt; Location</strong>. This report will tell you where your users are coming from, and will also allow you to compare behavior metrics (and different dimensions) for users from different countries, regions or cities.</p>\n<p><img src=\"https://www.sitepoint.com/wp-content/uploads/2017/10/1508948203countryga.png\" alt=\"Location report in Google Analytics\" width=\"1045\" height=\"503\" class=\"aligncenter size-full wp-image-161116\" />\t\t\t</p>\n<p>Looking at the percentage of visitors from each country will help you understand the importance of international visitors to your website.</p>\n<p>But you need to be careful with your analysis here. Just because no one visits your site from Canada, for example, doesn’t necessarily mean that audience is not important to you. You could be accidentally blocking them! Your marketing efforts may not be reaching where they should, or there may be a whole host of other reasons for the lack of visits. Once again, remember that your website analytics tell you <em>what</em>, but not <em>why</em>.</p>\n<p>You may be assuming your website only attracts visitors from your own country, but this report may show that you should also consider the needs of international visitors. This could lead to practical considerations—such as the load speed of your website in other countries, international delivery rates for an ecommerce site, and possible cultural differences between other countries and your own.</p>\n<p>Cultural differences based on the country of your visitors can be considerations for both your website’s design and functionality. These differences can be hard to cater for, as cultural differences may be subtle, and often won’t lead to clear ideas for design changes. Still, detailed research on the cultural needs of you users is definitely recommended.</p>\n<p>On a more practical level, the way people use ecommerce websites varies dramatically depending on their country. According to <a href=\"https://alternativepayments.worldpay.com/territories/DE\">data from Worldpay</a>, only 12% of users in Germany make online purchases using cards.</p>\n<p>This compares with 63% of UK users and 72% of users in the USA. If you notice that your ecommerce website is getting a lot of visits from Germany, you’ll want to look at offering alternative payment methods. The most popular type of online payment in Germany in real-time bank transfer.</p>\n<p>Looking beyond the number of visits, you’ll be able to see behavioral metrics, such as time on site, bounce rate and conversion rate. Focusing on user behavior will enable you to pinpoint particular countries where there may be issues with your website, and thus opportunities to make improvements. If, for example, your ecommerce website is getting a lot of visits from a certain country, or countries, but the conversion rate is low, you may want to reassure those users that you deliver internationally.</p>\n<p>There could be many reasons why your conversion rate is low in a particular country. You may not ship to that country, your site may be in the wrong language, the products may be cheaper in that country, or you may not offer the right payment methods (as in the example of Germany). This is where it’s important not to jump to conclusions. Remember, the data only tells you <em>what</em> is happening. It’s important that you set aside research time to find out <em>why</em>.</p>\n<p>If you can see an opportunity to increase your conversion rate internationally, you might also want to consider personalizing your website in some way for those countries. This could be as simple as showing the flag of that country and being up front about the exact costs and delivery times for that location. This simple form of personalization will likely resonate with your international users, and will help you unlock potential additional revenue from international sales.</p>\n<p>If your analytics shows you’re getting a lot of visits from other countries, you’re likely to be missing out if you don’t factor in cultural differences!</p>\n<p>Geo reports can locate users down to state and city level. This means you may also want to assess your visitors by state, region and city to get a clearer picture of who your visitors are and how they behave. The importance of this level of detail will depend on the purpose of your website. For political websites, for example, localized data can be very important to see how a candidate is performing in a key state or region.  </p>\n<h3 id=\"what-language-do-your-users-speak-\">What Language Do Your Users Speak?</h3>\n<p>Knowing what language your users speak can give you additional insight into the content you should serve up. Language and location are sometimes confused when looking at analytics, but the two dimensions have no direct connection. A user can be located in Paris but speak Spanish. Location is ascertained by the IP address of your user, while their language can be derived from the language settings of their browser.</p>\n",
    "protected": false
  },
  "author": 72443,
  "featured_media": 161158,
  "comment_status": "open",
  "ping_status": "closed",
  "sticky": false,
  "template": "",
  "format": "standard",
  "meta": [],
  "categories": [
    6131,
    425,
    412
  ],
  "tags": [
    904,
    10250,
    11007,
    1097
  ],
  "_links": {
    "self": [
      {
        "href": "https://www.sitepoint.com/wp-json/wp/v2/posts/161113"
      }
    ],
    "collection": [
      {
        "href": "https://www.sitepoint.com/wp-json/wp/v2/posts"
      }
    ],
    "about": [
      {
        "href": "https://www.sitepoint.com/wp-json/wp/v2/types/post"
      }
    ],
    "author": [
      {
        "embeddable": true,
        "href": "https://www.sitepoint.com/wp-json/wp/v2/users/72443"
      }
    ],
    "replies": [
      {
        "embeddable": true,
        "href": "https://www.sitepoint.com/wp-json/wp/v2/comments?post=161113"
      }
    ],
    "version-history": [
      {
        "href": "https://www.sitepoint.com/wp-json/wp/v2/posts/161113/revisions"
      }
    ],
    "wp:featuredmedia": [
      {
        "embeddable": true,
        "href": "https://www.sitepoint.com/wp-json/wp/v2/media/161158"
      }
    ],
    "wp:attachment": [
      {
        "href": "https://www.sitepoint.com/wp-json/wp/v2/media?parent=161113"
      }
    ],
    "wp:term": [
      {
        "taxonomy": "category",
        "embeddable": true,
        "href": "https://www.sitepoint.com/wp-json/wp/v2/categories?post=161113"
      },
      {
        "taxonomy": "post_tag",
        "embeddable": true,
        "href": "https://www.sitepoint.com/wp-json/wp/v2/tags?post=161113"
      }
    ],
    "curies": [
      {
        "name": "wp",
        "href": "https://api.w.org/{rel}",
        "templated": true
      }
    ]
  }
}